// Задача 18 Напишите программу, которая по заданному номеру четверти, 
// показывает диапазон возможных координат точек в этой четверти (x и y).


Console.Write("Введите номер четверти: ");
int N = int.Parse(Console.ReadLine());

int x=0;
int y=0;

if (N==1) Console.WriteLine("Диапазон возможных координат: x => 0++...+, y => 0++...+∞");
if (N==2) Console.WriteLine("Диапазон возможных координат: x => -∞++...0, y => 0++...+∞");
if (N==3) Console.WriteLine("Диапазон возможных координат: x => -∞++...0, y => -∞++...0");
if (N==4) Console.WriteLine("Диапазон возможных координат: x => 0++...+∞, y => -∞++...0");